## Cleaning File for 2018-19 Data

In [80]:
import pandas as pd
import numpy as np

In [81]:
roster_1819 = pd.read_stata('/Users/preetkhowaja/Documents/midssp2022/unifying/uds-2022-ids-701-team-3/00_source_data/1819_sec_1a.dta')
roster_1819.head()

,hhcode,province,region,psu,idc,s1aq02,s1aq03,s1aq04,s1aq05,age,s1aq62,s1aq63,s1aq64,s1aq07,s1aq08,s1aq09,s1aq10,s1aq11
0,1.102100e+09,khyber pakhtunkhwa,urban,11021001,1,brother/sister in law,main provider away for work,male,present,24,0,0,1994,unmarried / never married,NaN,98,55,yes
1,1.102100e+09,khyber pakhtunkhwa,urban,11021001,2,brother/sister in law,main provider away for work,male,present,23,0,0,1995,unmarried / never married,NaN,98,55,yes
2,1.102100e+09,khyber pakhtunkhwa,urban,11021001,51,head,NaN,female,present,28,0,0,1990,currently married,99.0,99,99,yes
3,1.102100e+09,khyber pakhtunkhwa,urban,11021001,52,son/daughter,main provider away for work,female,present,8,0,0,2010,unmarried / never married,NaN,99,51,yes
4,1.102100e+09,khyber pakhtunkhwa,urban,11021001,53,son/daughter,main provider away for work,female,present,7,0,0,2011,unmarried / never married,NaN,99,51,yes

In [82]:
# renaming relevant variables from roster
roster_1819['sex'] = roster_1819['s1aq04']
roster_1819['marital_status'] = roster_1819['s1aq07']
roster_1819.sample(4)

,hhcode,province,region,psu,idc,s1aq02,s1aq03,s1aq04,s1aq05,age,s1aq62,s1aq63,s1aq64,s1aq07,s1aq08,s1aq09,s1aq10,s1aq11,sex,marital_status
151624,4.302300e+09,balochistan,urban,43023004,60,grand child,family elder,male,present,3,0,0,2015,unmarried / never married,NaN,2,57,yes,male,unmarried / never married
88075,2.802200e+09,punjab,urban,28022003,52,son/daughter,main economic provider,female,present,21,0,0,1997,unmarried / never married,NaN,1,51,yes,female,unmarried / never married
92961,2.841101e+09,punjab,rural,28411009,51,spouse,main economic provider,female,present,41,1,1,1977,currently married,1.0,98,98,yes,female,currently married
157865,4.501401e+09,balochistan,rural,45014011,55,son/daughter,main economic provider,male,present,5,0,0,2013,unmarried / never married,NaN,1,51,yes,male,unmarried / never married

In [83]:
roster_1819.province.value_counts()

punjab                68716
sindh                 39421
khyber pakhtunkhwa    33851
balochistan           18856
8                      8348
7                      6498
Name: province, dtype: int64

In [84]:
B_relevant = roster_1819[['hhcode', 'idc','age', 'sex', 'marital_status']].copy()
B_relevant.sample(5)

              hhcode  idc  age     sex             marital_status
130780  3.502207e+09   51   36  female          currently married
86495   2.741101e+09   55    8    male  unmarried / never married
155340  4.501102e+09   53   16  female  unmarried / never married
101948  2.931302e+09   56    0  female  unmarried / never married
15555   1.311301e+09   51   35  female          currently married

In [85]:
data_1819 = pd.read_stata('/Users/preetkhowaja/Documents/midssp2022/unifying/uds-2022-ids-701-team-3/00_source_data/1819_sec_2ab.dta')
data_1819.head()

,hhcode,province,region,psu,idc,s2aq01,s2aq02,s2aq03,s2aq04,s2bq01,...,s2bq18,s2bq19a,s2bq19b,s2bq19c,s2bq19d,s2bq19e,s2bq19f,s2bq19g,s2bq19h,s2bq19i
0,1.102100e+09,khyber pakhtunkhwa,urban,11021001,1,yes,yes,yes,no,attended school/institution in past,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.102100e+09,khyber pakhtunkhwa,urban,11021001,2,yes,yes,yes,no,attended school/institution in past,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1.102100e+09,khyber pakhtunkhwa,urban,11021001,51,yes,yes,yes,no,attended school/institution in past,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.102100e+09,khyber pakhtunkhwa,urban,11021001,52,NaN,NaN,NaN,NaN,currently attending school,...,0-2 km,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,23000.0
4,1.102100e+09,khyber pakhtunkhwa,urban,11021001,53,NaN,NaN,NaN,NaN,currently attending school,...,0-2 km,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,18000.0

In [86]:
data_1819.s2bq01.value_counts()

never attended school                  63318
attended school/institution in past    44349
currently attending school             40047
Name: s2bq01, dtype: int64

In [87]:
# Create variable for ever_admitted and currently attending
data_1819['ever_admitted'] = np.where(data_1819.s2bq01 == 'never attended school', 'no', 'yes')
data_1819.ever_admitted.value_counts()
data_1819['currently_enrolled'] = np.where(data_1819.s2bq01 == 'currently attending school', 'yes', 'no')
data_1819.currently_enrolled.value_counts()

no     107667
yes     40047
Name: currently_enrolled, dtype: int64

In [88]:
C_relevant = data_1819[
    [
        "hhcode",
        "idc",
        "ever_admitted",
        "currently_enrolled",
        "region",
        "province"
    ]
].copy()

C_relevant.sample(5)

              hhcode  idc ever_admitted currently_enrolled region province
36435   2.131201e+09   54           yes                 no  rural   punjab
98277   3.141100e+09   51            no                 no  rural    sindh
107818  3.302403e+09   52           yes                 no  urban    sindh
73129   2.631201e+09   52           yes                 no  rural   punjab
59025   2.461301e+09   51            no                 no  rural   punjab

In [89]:
# Checking currently enrolled for NA values
C_relevant.currently_enrolled.isna().sum()

0

In [90]:
# MERGE 
years18_19 = pd.merge(B_relevant, C_relevant, on=["hhcode", 'idc'], how='inner', indicator=False)
# Evaluate merge by checking value counts for currently enrolled individuals
years18_19.currently_enrolled.value_counts()

no     107667
yes     40047
Name: currently_enrolled, dtype: int64

In [91]:
years18_19.loc[years18_19.hhcode == 1102100107.0]

,hhcode,idc,age,sex,marital_status,ever_admitted,currently_enrolled,region,province
39,1.102100e+09,1,37,male,currently married,yes,no,urban,khyber pakhtunkhwa
40,1.102100e+09,51,29,female,currently married,yes,no,urban,khyber pakhtunkhwa
41,1.102100e+09,52,10,female,unmarried / never married,yes,yes,urban,khyber pakhtunkhwa
42,1.102100e+09,53,4,male,unmarried / never married,no,no,urban,khyber pakhtunkhwa
43,1.102100e+09,55,25,female,unmarried / never married,no,no,urban,khyber pakhtunkhwa
44,1.102100e+09,56,57,female,widow / widower,yes,no,urban,khyber pakhtunkhwa

In [92]:
data_1819.loc[data_1819.hhcode == 1102100107]

,hhcode,province,region,psu,idc,s2aq01,s2aq02,s2aq03,s2aq04,s2bq01,...,s2bq19b,s2bq19c,s2bq19d,s2bq19e,s2bq19f,s2bq19g,s2bq19h,s2bq19i,ever_admitted,currently_enrolled
39,1.102100e+09,khyber pakhtunkhwa,urban,11021001,1,yes,yes,yes,no,attended school/institution in past,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,yes,no
40,1.102100e+09,khyber pakhtunkhwa,urban,11021001,51,yes,yes,yes,no,attended school/institution in past,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,yes,no
41,1.102100e+09,khyber pakhtunkhwa,urban,11021001,52,yes,yes,yes,NaN,currently attending school,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,24000.0,yes,yes
42,1.102100e+09,khyber pakhtunkhwa,urban,11021001,53,NaN,NaN,NaN,NaN,never attended school,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,no,no
43,1.102100e+09,khyber pakhtunkhwa,urban,11021001,55,no,NaN,no,no,never attended school,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,no,no
44,1.102100e+09,khyber pakhtunkhwa,urban,11021001,56,yes,yes,yes,no,attended school/institution in past,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,yes,no

In [93]:
# Select people in school enrollment age (I would say 4-10 years old)
years18_19 = years18_19.loc[(years18_19["age"] >= 4)&(years18_19["age"] <= 15)]

In [94]:
years18_19.province.value_counts()

punjab                20523
sindh                 12307
khyber pakhtunkhwa    11629
balochistan            6766
Name: province, dtype: int64

In [95]:
# Re-spell the names
years18_19['province'].replace('punjab', 'Punjab', inplace = True)
years18_19['province'].replace('khyber pakhtunkhwa', 'KPK', inplace = True)
years18_19['province'].replace('sindh', 'Sindh', inplace = True)
years18_19['province'].replace('balochistan', 'Balochistan', inplace = True)
years18_19.province.value_counts()

Punjab         20523
Sindh          12307
KPK            11629
Balochistan     6766
Name: province, dtype: int64

In [96]:
# Lets see which hh codes we have:
years18_19["hhcode"] = years18_19["hhcode"].astype("str")
years18_19['subprovince code']= years18_19['hhcode'].apply(lambda x: x[0:4])
years18_19["subprovince code"] = years18_19["subprovince code"].astype("int")
years18_19.head()

,hhcode,idc,age,sex,marital_status,ever_admitted,currently_enrolled,region,province,subprovince code
3,1102100101.0,52,8,female,unmarried / never married,yes,yes,urban,KPK,1102
4,1102100101.0,53,7,female,unmarried / never married,yes,yes,urban,KPK,1102
5,1102100101.0,54,5,female,unmarried / never married,no,no,urban,KPK,1102
12,1102100102.0,54,12,female,unmarried / never married,yes,yes,urban,KPK,1102
13,1102100102.0,55,8,male,unmarried / never married,yes,yes,urban,KPK,1102

In [97]:
stratum_1819 = pd.read_csv('/Users/preetkhowaja/Documents/midssp2022/unifying/uds-2022-ids-701-team-3/00_source_data/stratum_1819.csv')
stratum_1819 = stratum_1819[['subprovince', 'subprovince code']]
stratum_1819.sample(2)

    subprovince  subprovince code
165      Khyber              1441
140    Sudhnoti              8202

In [98]:
# Merge stratum data with edu and sex data
years18_19_ = pd.merge(years18_19, stratum_1819, on=["subprovince code"], how='inner', indicator=True)

# Evaluate merge 
years18_19_._merge.value_counts()

both          85821
left_only         0
right_only        0
Name: _merge, dtype: int64

In [99]:
years18_19_.drop(columns= ['_merge'], inplace = True)
years18_19_.head()

,hhcode,idc,age,sex,marital_status,ever_admitted,currently_enrolled,region,province,subprovince code,subprovince
0,1102100101.0,52,8,female,unmarried / never married,yes,yes,urban,KPK,1102,Chitral
1,1102100101.0,52,8,female,unmarried / never married,yes,yes,urban,KPK,1102,Upper Dir
2,1102100101.0,52,8,female,unmarried / never married,yes,yes,urban,KPK,1102,Lower Dir
3,1102100101.0,52,8,female,unmarried / never married,yes,yes,urban,KPK,1102,Swat
4,1102100101.0,52,8,female,unmarried / never married,yes,yes,urban,KPK,1102,Shangla

In [100]:
# Add year indicator for 2018
years18_19_['Year'] = 2018

In [101]:
years18_19_.marital_status.value_counts()

unmarried / never married                         85768
currently married                                    48
nikkah solemnized but rukhsati not taken place        4
separated                                             1
0                                                     0
widow / widower                                       0
divorced                                              0
Name: marital_status, dtype: int64

In [102]:
# Recode marital status
years18_19_.marital_status.replace('unmarried / never married', 1, inplace = True)
years18_19_.marital_status.replace('currently married', 2, inplace = True)
years18_19_.marital_status.replace('widow / widower', 3, inplace = True)
years18_19_.marital_status.replace('separated', 4, inplace = True)
years18_19_.marital_status.replace('divorced', 4, inplace = True)
years18_19_.marital_status.replace('nikkah solemnized but rukhsati not taken place', 5, inplace = True)
years18_19_.marital_status.value_counts()

1    85768
2       48
5        4
4        1
0        0
3        0
Name: marital_status, dtype: int64

In [103]:
years18_19_.isna().any()

hhcode                False
idc                   False
age                   False
sex                   False
marital_status        False
ever_admitted         False
currently_enrolled    False
region                False
province              False
subprovince code      False
subprovince           False
Year                  False
dtype: bool

In [104]:
# Save to csv
years18_19_.to_csv('/Users/preetkhowaja/Documents/midssp2022/unifying/uds-2022-ids-701-team-3/10_data_cleaning/clean_preet/years18_19_.csv', index_label='id')

In [107]:
years18_19_[(years18_19_.subprovince == 'Korangi')]

,hhcode,idc,age,sex,marital_status,ever_admitted,currently_enrolled,region,province,subprovince code,subprovince,Year
60029,3502100301.0,2,10,male,1,yes,yes,urban,Sindh,3502,Korangi,2018
60035,3502100301.0,53,7,female,1,yes,yes,urban,Sindh,3502,Korangi,2018
60041,3502100304.0,52,4,female,1,no,no,urban,Sindh,3502,Korangi,2018
60047,3502100305.0,53,8,female,1,yes,yes,urban,Sindh,3502,Korangi,2018
60053,3502100306.0,53,15,female,1,yes,yes,urban,Sindh,3502,Korangi,2018
...,...,...,...,...,...,...,...,...,...,...,...,...
73877,3502414608.0,54,6,female,1,yes,yes,urban,Sindh,3502,Korangi,2018
73883,3502414608.0,55,4,male,1,yes,yes,urban,Sindh,3502,Korangi,2018
73889,3502414611.0,2,10,male,1,yes,yes,urban,Sindh,3502,Korangi,2018
73895,3502414612.0,3,14,male,1,yes,yes,urban,Sindh,3502,Korangi,2018
73901,3502414612.0,4,12,male,1,no,no,urban,Sindh,3502,Korangi,2018

In [111]:
# PRE-PROCESSING FOR DIFF-IN-DIFF DATA
# convert currently_enrolled from string to integer
years18_19_["currently_enrolled"].replace("yes", 1, inplace=True)
years18_19_["currently_enrolled"].replace("no", 0, inplace=True)

In [112]:
years18_19_.currently_enrolled.dtype

dtype('int64')

In [113]:
#check region for anomalies
# years19_20_.region.value_counts()
# years19_20_["region"].replace(3, "urban", inplace=True)
# aggregate dataset for sample population
df_grp_1 = years18_19_.groupby(["sex","subprovince","region"])["currently_enrolled"].count().reset_index()
# aggregate dataset for enrollment total
df_grp_2 = years18_19_.groupby(["sex","subprovince","region"])["currently_enrolled"].sum().reset_index()
# merge data set
df_grp_merge = pd.merge(df_grp_1, df_grp_2, on=["sex","subprovince","region"], indicator=True)
# check merge
df_grp_merge._merge.value_counts()

both          524
left_only       0
right_only      0
Name: _merge, dtype: int64

In [115]:
df_grp_merge.sample(3)

,sex,subprovince,region,currently_enrolled_x,currently_enrolled_y,_merge
93,male,Kasur,urban,947,798,both
330,female,Jhal Magsi,rural,0,0,both
165,male,Musakhel,urban,90,65,both

In [116]:
# Code Cell 2:
# compute enrollment_rate
df_grp_merge["rate_enrollment"] = (
    df_grp_merge["currently_enrolled_y"] / df_grp_merge["currently_enrolled_x"]
)
# rename columns
df_grp_merge = df_grp_merge.rename(
    columns={
        "currently_enrolled_x": "sample_population",
        "currently_enrolled_y": "enrolled_total",
    }
)
# drop "_merge" column
df_grp_merge.drop(["_merge"], axis=1, inplace=True)
df_grp_merge.sample(5)

,sex,subprovince,region,sample_population,enrolled_total,rate_enrollment
425,female,Multan,urban,289,246,0.851211
265,female,Attock,urban,250,219,0.876000
198,male,Rahim Yar Khan,rural,0,0,NaN
349,female,Karachi West,urban,1154,883,0.765165
474,female,Shangla,rural,106,55,0.518868

In [117]:
# Check for NAs before saving
df_grp_merge.isna().any()

sex                  False
subprovince          False
region               False
sample_population    False
enrolled_total       False
rate_enrollment       True
dtype: bool

In [ ]:
#Code Cell 3:
# save clean difference-in-difference data set
df_grp_merge.to_csv("/Users/preetkhowaja/Documents/midssp2022/unifying/uds-2022-ids-701-team-3/20_analysis/enrollment_clean/years18_19_merge_diff.csv")